podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/USBPHY0_MK28F15.svd.xml
            <register derivedFrom="USB1_VBUS_DETECT_SET"> <name>USB1_VBUS_DETECT_CLR</name> <addressOffset>0xC8</addressOffset> </register>
            <register derivedFrom="USB1_VBUS_DETECT_SET"> <name>USB1_VBUS_DETECT_TOG</name> <addressOffset>0xCC</addressOffset> </register>
            <register>
               <name>USB1_VBUS_DET_STAT</name>
               <description>USB PHY VBUS Detector Status Register</description>
               <addressOffset>0xD0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SESSEND</name>
                     <description>Session End indicator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The VBUS voltage is above the Session Valid threshold</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The VBUS voltage is below the Session Valid threshold</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BVALID</name>
                     <description>B-Device Session Valid status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The VBUS voltage is below the Session Valid threshold</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The VBUS voltage is above the Session Valid threshold</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="BVALID" > <name>AVALID</name> <description>A-Device Session Valid status</description> <bitOffset>2</bitOffset> </field>
                  <field>
                     <name>VBUS_VALID</name>
                     <description>VBUS voltage status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>VBUS is below the comparator threshold</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>VBUS is above the comparator threshold</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VBUS_VALID_3V</name>
                     <description>VBUS_VALID_3V detector status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>VBUS voltage is below VBUS_VALID_3V threshold</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>VBUS voltage is above VBUS_VALID_3V threshold</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USB1_CHRG_DET_STAT</name>
               <description>USB PHY Charger Detect Status Register</description>
               <addressOffset>0xF0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PLUG_CONTACT</name>
                     <description>Battery Charging Data Contact Detection phase output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No USB cable attachment has been detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A USB cable attachment between the device and host has been detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHRG_DETECTED</name>
                     <description>Battery Charging Primary Detection phase output</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Standard Downstream Port (SDP) has been detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Charging Port has been detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DM_STATE</name>
                     <description>Single ended receiver output for the USB_DM pin, from charger detection circuits</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>USB_DM pin voltage is &lt; 0.8V</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>USB_DM pin voltage is &gt; 2.0V</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DP_STATE</name>
                     <description>Single ended receiver output for the USB_DP pin, from charger detection circuits</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>USB_DP pin voltage is &lt; 0.8V</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>USB_DP pin voltage is &gt; 2.0V</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SECDET_DCP</name>
                     <description>Battery Charging Secondary Detection phase output</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Charging Downstream Port (CDP) has been detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Downstream Charging Port (DCP) has been detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ANACTRL</name>
               <description>USB PHY Analog Control Register</description>
               <addressOffset>0x100</addressOffset>
               <resetValue>0x402</resetValue>
               <fields>
                  <field>
                     <name>TESTCLK_SEL</name>
                     <description>Test clock selection to analog test</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFD_CLKGATE</name>
                     <description>This bit field controls clock gating (disabling) for the PFD pfd_clk output for power savings when the PFD is not used</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PFD clock output is enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>PFD clock output is gated (Default)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PFD_CLK_SEL</name>
                     <description>This bit field for the PFD selects the frequency relationship between the local pfd_clk output and the exported USB1PFDCLK</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>USB1PFDCLK is the same frequency as the xtal clock (Default)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>USB1PFDCLK frequency is pfd_clk divided by 4</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>USB1PFDCLK frequency is pfd_clk divided by 2</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>USB1PFDCLK frequency is the same as pfd_clk frequency</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PFD_FRAC</name>
                     <description>PFD fractional divider setting used to select the pfd_clk output frequency</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DEV_PULLDOWN</name>
                     <description>Setting this field to 1&apos;b1 will enable the 15kohm pulldown resistors on both USB_DP and USB_DM pins</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare disabled in device mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare enabled in device mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EMPH_PULSE_CTRL</name>
                     <description>Controls pre-emphasis time duration for the High Speed TX drivers after each data transition when the USBPHY_ANACTRL[EMPH_EN] bit is set high to 1&apos;b1</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Minimum duration of pre-emphasis current after each data transition</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Maximum duration of pre-emphasis current after each data transition</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EMPH_EN</name>
                     <description>Enables pre-emphasis for the High-Speed TX drivers</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No pre-emphasis is used on HS TX output drivers</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enables pre-emphasis for HS TX output drivers</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EMPH_CUR_CTRL</name>
                     <description>Controls the amount of pre-emphasis current added for the High-Speed TX drivers after each data transition when the USBPHY_ANACTRL[EMPH_EN] bit is set high to 1&apos;b1</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>No pre-emphasis current is enabled for the HS TX drivers</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>One unit of pre-emphasis current is enabled for the HS TX drivers</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Two units of pre-emphasis current are enabled for the HS TX drivers</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Three units of pre-emphasis current are enabled for the HS TX drivers</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PFD_STABLE</name>
                     <description>PFD stable signal from the Phase Fractional Divider</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register derivedFrom="ANACTRL"> <name>ANACTRL_SET</name> <addressOffset>0x104</addressOffset> </register>
            <register derivedFrom="ANACTRL"> <name>ANACTRL_CLR</name> <addressOffset>0x108</addressOffset> </register>
            <register derivedFrom="ANACTRL"> <name>ANACTRL_TOG</name> <addressOffset>0x10C</addressOffset> </register>
            <register>
               <name>USB1_LOOPBACK</name>
               <description>USB PHY Loopback Control/Status Register</description>
               <addressOffset>0x110</addressOffset>
               <resetValue>0x550000</resetValue>
               <fields>
                  <field>
                     <name>UTMI_TESTSTART</name>
                     <description>This bit enables the USB loopback test</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UTMI_DIG_TST0</name>
                     <description>Mode control for USB loopback test</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UTMI_DIG_TST1</name>
                     <description>Mode control for USB loopback test</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSTI_TX_HS_MODE</name>
                     <description>Select HS or FS mode for USB loopback testing</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSTI_TX_LS_MODE</name>
                     <description>Set to value 1&apos;b1 to choose LS for USB loopback testing, set to value 1&apos;b0 to choose HS or FS mode which is defined by TSTI1_TX_HS</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSTI_TX_EN</name>
                     <description>Enable TX for USB loopback test</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSTI_TX_HIZ</name>
                     <description>Sets TX Hi-Z for USB loopback test</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UTMO_DIG_TST0</name>
                     <description>This read-only bit is a status bit for USB loopback test results</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>UTMO_DIG_TST1</name>
                     <description>This read-only bit is a status bit for USB loopback test</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TSTI_HSFS_MODE_EN</name>
                     <description>Setting this bit field to value 1&apos;b1 will enable the loopback test to dynamically change the packet speed</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TSTPKT</name>
                     <description>Selects the packet data byte used for USB loopback testing in Pulse mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register derivedFrom="USB1_LOOPBACK"> <name>USB1_LOOPBACK_SET</name> <addressOffset>0x114</addressOffset> </register>
            <register derivedFrom="USB1_LOOPBACK"> <name>USB1_LOOPBACK_CLR</name> <addressOffset>0x118</addressOffset> </register>
            <register derivedFrom="USB1_LOOPBACK"> <name>USB1_LOOPBACK_TOG</name> <addressOffset>0x11C</addressOffset> </register>
            <register>
               <name>USB1_LOOPBACK_HSFSCNT</name>
               <description>USB PHY Loopback Packet Number Select Register</description>
               <addressOffset>0x120</addressOffset>
               <resetValue>0x40010</resetValue>
               <fields>
                  <field>
                     <name>TSTI_HS_NUMBER</name>
                     <description>High speed packet number, used when USBPHY_USB1_LOOPBACK[TSTI_HSFS_MODE_EN] is set to value 1&apos;b1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TSTI_FS_NUMBER</name>
                     <description>Full speed packet number, used when USBPHY_USB1_LOOPBACK[TSTI_HSFS_MODE_EN] is set to value 1&apos;b1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
