podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/USBPHY0_MK28F15.svd.xml
            <register derivedFrom="USB1_LOOPBACK_HSFSCNT"> <name>USB1_LOOPBACK_HSFSCNT_SET</name> <addressOffset>0x124</addressOffset> </register>
            <register derivedFrom="USB1_LOOPBACK_HSFSCNT"> <name>USB1_LOOPBACK_HSFSCNT_CLR</name> <addressOffset>0x128</addressOffset> </register>
            <register derivedFrom="USB1_LOOPBACK_HSFSCNT"> <name>USB1_LOOPBACK_HSFSCNT_TOG</name> <addressOffset>0x12C</addressOffset> </register>
            <register>
               <name>TRIM_OVERRIDE_EN</name>
               <description>USB PHY Trim Override Enable Register</description>
               <addressOffset>0x130</addressOffset>
               <resetValue>0x66700000</resetValue>
               <fields>
                  <field>
                     <name>TRIM_DIV_SEL_OVERRIDE</name>
                     <description>Override enable for PLL_DIV_SEL, when set, the register value in USBPHY_PLL_SIC[1:0] will be used</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIM_ENV_TAIL_ADJ_VD_OVERRIDE</name>
                     <description>Override enable for ENV_TAIL_ADJ, when set, the register value in USBPHY_DEBUG1[14:13] will be used</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIM_TX_D_CAL_OVERRIDE</name>
                     <description>Override enable for TX_D_CAL, when set, the register value in USBPHY_TX[3:0] will be used</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIM_TX_CAL45DP_OVERRIDE</name>
                     <description>Override enable for TX_CAL45DP, when set, the register value in USBPHY_TX[19:16] will be used</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIM_TX_CAL45DM_OVERRIDE</name>
                     <description>Override enable for TX_CAL45DM, when set, the register value in USBPHY_TX[11:8] will be used</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIM_PLL_CTRL0_DIV_SEL</name>
                     <description>IFR value of PLL_DIV_SEL</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TRIM_USB_REG_ENV_TAIL_ADJ_VD</name>
                     <description>IFR value of ENV_TAIL_ADJ</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TRIM_USBPHY_TX_D_CAL</name>
                     <description>IFR value of TX_D_CAL</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TRIM_USBPHY_TX_CAL45DP</name>
                     <description>IFR value of TX_CAL45DP</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TRIM_USBPHY_TX_CAL45DM</name>
                     <description>IFR value of TX_CAL45DM</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register derivedFrom="TRIM_OVERRIDE_EN"> <name>TRIM_OVERRIDE_EN_SET</name> <addressOffset>0x134</addressOffset> </register>
            <register derivedFrom="TRIM_OVERRIDE_EN"> <name>TRIM_OVERRIDE_EN_CLR</name> <addressOffset>0x138</addressOffset> </register>
            <register derivedFrom="TRIM_OVERRIDE_EN"> <name>TRIM_OVERRIDE_EN_TOG</name> <addressOffset>0x13C</addressOffset> </register>
         </registers>
      </peripheral>
